# Module 3 - Structured Query Language (SQL)
Throughout this module you will learn to work with the programming language SQL.

You will be working with a simple database consisting of three tables:

1. Table `customers` with columns:
   * `id`: The unique ID reference of the customer (`int`).
   * `first_name`: The first name of the customer (`str`).
   * `last_name`: The last name of the customer (`str`).
   * `address`: The street name and house number of the customer (`str`).
2. Table `products` with columns:
   * `id`: The unique ID reference of the product (`int`).
   * `name`: The name of the product, as displayed to the customer (`str`).
   * `price`: The purchase price of the product (`float`).
   * `stock`: The amount of products currently in stock (`int`). 
3. Table `orders` with columns:
   * `id`: The unique ID reference of the order (`int`).
   * `customer_id`: The ID reference of the customer that placed the order (`int`).
   * `product_id`: The ID reference of the product the order is placed for (`int`).
   * `date`: The date the order is placed on (`datetime.date`).
   * `quantity`: The amount of the given product purchased (`int`).

Good luck!

## Contents
* [A. Setup](#a-setup)
* [B. Basic operations](#b-basic-operations)
  * [Question B1](#question-b1)
  * [Question B2](#question-b2)
  * [Question B3](#question-b3)
  * [Question B4](#question-b4)
  * [Question B5](#question-b5)
* [C. Database operations](#c-database-operations)
  * [Question C1](#question-c1)
  * [Question C2](#question-c2)
  * [Question C3](#question-c3)
  * [Question C4](#question-c4)
  * [Question C5](#question-c5)
* [D. Calculation operators](#d-calculation-operators)
  * [Question D1](#question-d1)
  * [Question D2](#question-d2)
  * [Question D3](#question-d3)
  * [Question D4](#question-d4)
* [E. Writing complex (multi-table) queries](#e-writing-complex-multi-table-queries)
  * [Question E1](#question-e1)
  * [Question E2](#question-e2)
  * [Question E3](#question-e3)
  * [Question E4](#question-e4)

<hr>

## A. Setup
Like the previous module, at Datacation we have already pre-written some code for you. <br> 
This enables you to check your answers and help you access the database that we'll use.

We import it below:

In [1]:
from datacademy.modules import Module03

# NOTE: Each run of this cell resets the database!
module = Module03()

`Module03` has some extra functionalty: 
* In the background it creates a database, that by default will be saved to `database.db`.
* It has the `module.query()` function that allows you to execute SQL on the database.
* For a query and check at once, it has the `module.check_query()` function.

Try `model.query()` below. You can use if if you want to test a query without checking it.

In [2]:
# Show the names of all our customers on alphabetical (first name) order
module.query('select first_name, last_name from customers order by first_name')

   first_name last_name
0      Arthur    Holmes
1      Ashton      Cole
2       Axton    Rogers
3     Cameron    Taylor
4     Deshawn    Booker
5       Ellis      West
6       Jamie      Dean
7        John       Doe
8      Raylee      Diaz
9        Reed     Nixon
10       Shay      Hyde
11    Vicente    Bryant

[Back to top](#module-3---structured-query-language-sql)

<hr>

## B. Basic operations
First we will explore the basic operations, namely `SELECT`, `FROM`, `WHERE`, `LIMIT` and `ORDER BY`. <br>
These operations form the base of most queries that you will write in the future, as they are most fundamental to the retrieval of data. <br>
The operations and their functionality will be listed below:

* `SELECT` - Defines the column values that you desired to retrieve.
* `FROM` - Defines the table from which these values need to be retrieved.
* `WHERE` - Defines the condition(s) that will affect which rows are returned.
* `LIMIT` - Defines the number of rows that are returned.
* `ORDER BY` - Defines the way the records that are returned will be sorted.

In this module you will explore the functionalities of these operators using the just created database. <br>
The tables and their columns are described in the beginning of this notebook. <br> 
You can use this description in the exercies below.

The first queries you will write are simple retrieval queries.

### Question B1
Retrieve all available information regarding products contained in the `products` table.

In [3]:
Q_B1 = 'SELECT * FROM products;'

module.check_query('B1', Q_B1)

游릭 That's correct!

   id                      name   price  stock
0   0  Copying paper (500 pcs.)    4.95    304
1   1          Binders (3 pcs.)    8.30     33
2   2             Office chairs  159.99     25
3   3                      Desk  254.99     12
4   4                PC monitor  188.99     48
5   5            Computer mouse   16.99     80
6   6            Pens (50 pcs.)   23.60    143
7   7      Black toners (2pcs.)   39.95    228

### Question B2
Retrieve all rows of the `orders` table that have a `quantity` of 5 or more products, showing the `customer_id`, `product_id` and `quantity`.

In [4]:
Q_B2 = 'SELECT customer_id, product_id, quantity FROM orders WHERE quantity >= 5;'

module.check_query('B2', Q_B2)

游릭 That's correct!

   customer_id  product_id  quantity
0            5           5         5
1           11           2         6
2            0           3         6
3            2           7         6
4            1           7         5
5            8           7         5

### Question B3
Retrieve first and last name of all customers with a first name that starts with a `"J"`.

In [5]:
Q_B3 = 'SELECT first_name, last_name FROM customers WHERE first_name LIKE "J%";'

module.check_query('B3', Q_B3)

游릭 That's correct!

  first_name last_name
0       John       Doe
1      Jamie      Dean

### Question B4
Retrieve all available information of the top 6 largest orders in terms of quantity.

In [6]:
Q_B4 = 'SELECT * FROM orders ORDER BY quantity DESC LIMIT 6;'

module.check_query('B4', Q_B4)

游릭 That's correct!

   id  customer_id  product_id        date  quantity
0   5           11           2  2022-02-08         6
1   6            0           3  2022-12-12         6
2   7            2           7  2022-04-06         6
3   0            5           5  2022-11-07         5
4  12            1           7  2022-10-13         5
5  19            8           7  2022-12-19         5

### Question B5
Retrieve only the name and price of the cheapest product in the `products` table.

In [7]:
Q_B5 = 'SELECT name, price FROM products ORDER BY price LIMIT 1;'

module.check_query('B5', Q_B5)

游릭 That's correct!

                       name  price
0  Copying paper (500 pcs.)   4.95

[Back to top](#module-3---structured-query-language-sql)

<hr>

## C. Database operations
Besides execution of basic reading operations, also a lot of database operations are available. <br>
These operations include Creating, Updating an Deleting operations. <br>
These operations form the foundation for every Database developer and/or administrator. <br>
Understanding these functionalities, you will be able to create, access and manipulate databases. <br>
The operations and their functionaltiy will be listed below:

* `CREATE TABLE` - Creates a table with the given table name.
* `INSERT INTO` - Allows you to add new records to the database table.
* `UPDATE` - Allows you to adjust data in existing records within the database table.
* `DELETE FROM` - Allows you to delete one or multiple data records from the database table.
* `DROP TABLE` - Allows you to drop an entire table from the database.

### Question C1
Write a query that creates a new table called `campaigns`, which contains all marketing campaigns of different products. <br>
The table should consists of the following columns and their corresponding data types:

* `id` - Integer, Primary Key, Auto Increment
* `product_id` - Integer, Foreign Key (reference: products.id)
* `campaign_start` - Timestamp
* `campaign_end` - Timestamp
* `discount` - float

In [8]:
# Drop the table if it already exists to avoid errors
module.query('DROP TABLE IF EXISTS campaigns')

# Enter your query here
Q_C1 = """
CREATE TABLE campaigns (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    product_id INTEGER,
    campaign_start TIMESTAMP,
    campaign_end TIMESTAMP,
    discount FLOAT,
    FOREIGN KEY (product_id) REFERENCES products(id)
);
"""

# Execute query to create the database
module.query(Q_C1)

# Check
module.check_query('C1', 'SELECT * FROM campaigns')

Table dropped successfully!
Table created successfully!
游릭 That's correct!

Empty DataFrame
Columns: [id, product_id, campaign_start, campaign_end, discount]
Index: []

### Question C2
Now it is time to populate your newly created table. <br>
Please insert the following data onto the campaigns table. <br>

```json
{ 
    "product_id": 4,
    "campaign_start": "2022-01-01",
    "campaign_end": "2022-04-08",
    "discount": 0.20
}
```

In [9]:
Q_C2_1 = """
INSERT INTO campaigns (product_id, campaign_start, campaign_end, discount)
VALUES (4, '2022-01-01', '2022-04-08', 0.20);
"""

module.query(Q_C2_1)

Data inserted successfully!

```json
{ 
    "product_id": 6,
    "campaign_start": "2022-02-02",
    "campaign_end": "2022-06-23",
    "discount": 0.15
}
```

In [10]:
Q_C2_2 = """
INSERT INTO campaigns (product_id, campaign_start, campaign_end, discount)
VALUES (6, '2022-02-02', '2022-06-23', 0.15);
"""

module.query(Q_C2_2)

Data inserted successfully!

```json
{ 
    "product_id": 4,
    "campaign_start": "2022-04-20",
    "campaign_end": "2022-07-15",
    "discount": 0.30
}
```

In [11]:
Q_C2_3 = """
INSERT INTO campaigns (product_id, campaign_start, campaign_end, discount)
VALUES (4, '2022-04-20', '2022-07-15', 0.30);
"""

module.query(Q_C2_3)

Data inserted successfully!

```json
{ 
    "product_id": 7,
    "campaign_start": "2022-10-20",
    "campaign_end": "2022-12-31",
    "discount": 0.125
}
```

In [12]:
Q_C2_4 = """
INSERT INTO campaigns (product_id, campaign_start, campaign_end, discount)
VALUES (7, '2022-10-20', '2022-12-31', 0.125);
"""

module.query(Q_C2_4)

Data inserted successfully!

Now run the query below to check your results.

> **Tip** - Do you see more than 4 rows? You might have ran one of the cells multiple times. Run the cell of question C1 and the above cells of C2 again, as this might resolve this.

In [13]:
# Query table to check result
module.check_query('C2', 'SELECT * FROM campaigns;')

游릭 That's correct!

   id  product_id campaign_start campaign_end  discount
0   1           4     2022-01-01   2022-04-08     0.200
1   2           6     2022-02-02   2022-06-23     0.150
2   3           4     2022-04-20   2022-07-15     0.300
3   4           7     2022-10-20   2022-12-31     0.125

### Question C3
We have actually made some mistake with inserting the campaigns into the database. <br>
Make the following adjustments to the database records.

For the campaign with `id` `1`, Change the start date from: `'2022-01-01'` to `'2022-01-25'`.

In [14]:
Q_C3_1 = 'UPDATE campaigns SET campaign_start = "2022-01-25" WHERE id = 1;' 

module.query(Q_C3_1)

Data record updated successfully!

For the campaign(s) with end date `'2022-06-23'`, Change the start date to `'2022-01-01'` and the end date to `'2022-12-31'`.

In [15]:
Q_C3_2 = "UPDATE campaigns SET campaign_start = '2022-01-01', campaign_end = '2022-12-31' WHERE campaign_end = '2022-06-23';" 

module.query(Q_C3_2)

Data record updated successfully!

For the campaign(s) concerning `product_id` `4`, change the discount to `0.25`.

In [16]:
Q_C3_3 = "UPDATE campaigns SET discount = 0.25 WHERE product_id = 4;" 

module.query(Q_C3_3)

Data record updated successfully!

Now run the following cell to check your result:

In [17]:
# Query table to check result
module.check_query('C3', 'SELECT * FROM campaigns;')

游릭 That's correct!

   id  product_id campaign_start campaign_end  discount
0   1           4     2022-01-25   2022-04-08     0.250
1   2           6     2022-01-01   2022-12-31     0.150
2   3           4     2022-04-20   2022-07-15     0.250
3   4           7     2022-10-20   2022-12-31     0.125

### Question C4
Deletion of record can also be done in a similar manner as previous database mutations using the WHERE clause. <br>
Write the queries executing the following behavior.

Remove all campaigns that concern `product_id` `6`.

In [18]:
Q_C4_1 = "DELETE FROM campaigns where product_id = 6;"

module.query(Q_C4_1)

# Query table to check results
module.check_query('C4-1', 'SELECT * FROM campaigns;')

Data record deleted successfully!
游릭 That's correct!

   id  product_id campaign_start campaign_end  discount
0   1           4     2022-01-25   2022-04-08     0.250
1   3           4     2022-04-20   2022-07-15     0.250
2   4           7     2022-10-20   2022-12-31     0.125

Remove all other campaigns, emptying this database table.

In [19]:
Q_C4_2 = "DELETE FROM campaigns"

module.query(Q_C4_2)

# Query table to check results
module.check_query('C4-2', 'SELECT * FROM campaigns;')

Data record deleted successfully!
游릭 That's correct!

Empty DataFrame
Columns: [id, product_id, campaign_start, campaign_end, discount]
Index: []

## Caution!
The last query you wrote to remove all campaigns shows the danger of using the `DELETE FROM` operator. <br>
When using this operator make sure to **always include a where condition**, as otherwise the database table is emptied. <br>
If such a query without a condition is executed on an actual database table the data will be removed without a possibility of to be retrieved.

### Question C5
The created `campaigns` table is only created and used to practice the database operators. <br>
For the following excersises we will clean the database by dropping the `campaigns` table. <br>
Write a query that drops the table from te database, only leaving the `customers`, `products` and `orders` tables.

In [20]:
Q_C5_1 = "DROP TABLE IF EXISTS campaigns;"

# Execute your query
module.query(Q_C5_1)

# Check the result
module.check_query('C5', 'SELECT name FROM sqlite_master WHERE type="table" ORDER BY name;')

Table dropped successfully!
游릭 That's correct!

              name
0        customers
1           orders
2         products
3  sqlite_sequence

[Back to top](#module-3---structured-query-language-sql)
<hr>

## D. Calculation operators
Next, we will look into calculation operators, which extends the possibilities of what can be retrieved from the database. <br>
Instead of simply only using the `SELECT` operator, the calculation operators can perform calculations on the values that are retrieved. <br>
There are a lot of possible calculation operators, however the most commonly used are the `MAX`, `MIN`, `SUM` and `COUNT` operators.

Together with the `GROUP BY` operator you can perform some useful calculative queries that are able to return great Business Intelligence. <br>
When using `GROUP BY`, conditional retrieval is done using `HAVING` instead of `WHERE`, which also works for calculations.

### Question D1
Retrieve the total number of orders that are contained in the orders table in a column called `number_of_orders`.

In [21]:
Q_D1 = "SELECT COUNT(*) AS number_of_orders FROM orders"

module.check_query('D1', Q_D1)

游릭 That's correct!

   number_of_orders
0                20

### Question D2
Return the product name and the total value stored in inventory (`price` * `stock`), in a column called `inventory`.

In [22]:
Q_D2 = "SELECT name, price*stock AS inventory FROM products"

module.check_query('D2', Q_D2)

游릭 That's correct!

                       name  inventory
0  Copying paper (500 pcs.)    1504.80
1          Binders (3 pcs.)     273.90
2             Office chairs    3999.75
3                      Desk    3059.88
4                PC monitor    9071.52
5            Computer mouse    1359.20
6            Pens (50 pcs.)    3374.80
7      Black toners (2pcs.)    9108.60

### Question D3
Return the `product_id` and the largest quantity (as `largest_quantity`) ordered for all products separately (using `GROUP BY`).

In [23]:
Q_D3 = "SELECT product_id, MAX(quantity) AS largest_quantity FROM orders GROUP BY product_id;"

module.check_query('D3', Q_D3)

游릭 That's correct!

   product_id  largest_quantity
0           0                 4
1           1                 2
2           2                 6
3           3                 6
4           4                 4
5           5                 5
6           6                 4
7           7                 6

### Question D4
Return the `product_id` and the number of different customers (as `distinct_customers`) for all products separately (using `DISTINCT()`), only returning products with two or more distinct customers.

In [24]:
Q_D4 = "SELECT product_id, COUNT(DISTINCT(customer_id)) AS distinct_customers FROM orders GROUP BY product_id HAVING distinct_customers >= 2;"

module.check_query('D4', Q_D4)

游릭 That's correct!

   product_id  distinct_customers
0           0                   2
1           3                   4
2           5                   2
3           6                   2
4           7                   4

[Back to top](#module-3---structured-query-language-sql)
<hr>

## E. Writing complex (multi-table) queries
To enable the full extend of the capabilities of the SQL language, the `JOIN` operator will be introduced. <br>
`JOIN` allows you to query data from multiple tables, which enables you to write complex multi-table queries. <br>
Within this module you will be asked to use both the *basic* and *calculation* operators combined with `JOIN`.

Besides the `JOIN` operator, it is also possible to include other information using *sub-queries*. <br>
Sub-queries allow you to use the results of a sub-query in a conditional statement for another query. <br>


As an example, you can use the query below to retrieve all information of customers that placed at least one order with a quantity larger than 3.

```sql
SELECT * 
FROM customers 
WHERE customers.id IN (
    SELECT customer_id 
    FROM orders 
    WHERE quantity > 3
);
```

The queries you have to write will be formulated as requests from different departments. <br>
If you will be working with databases in the future, you will be faced with such query requests.

### Question E1
Sales wants to analyse the number of products that are ordered 3 or more times, retrieve only the product names and the number of orders (as `number_of_orders`).

In [25]:
Q_E1 = """
SELECT products.name, COUNT(orders.id) AS number_of_orders
FROM products
INNER JOIN orders ON products.id = orders.product_id 
GROUP BY products.name
HAVING number_of_orders >= 3;
"""

module.check_query('E1', Q_E1)

游릭 That's correct!

                       name  number_of_orders
0      Black toners (2pcs.)                 4
1            Computer mouse                 3
2  Copying paper (500 pcs.)                 4
3                      Desk                 4

### Question E2
The marketing department asks for all first and last names of customers who ordered a "Desk" in the past.

In [26]:
Q_E2 = """
SELECT customers.first_name, customers.last_name
FROM customers
WHERE customers.id IN (
    SELECT orders.customer_id 
    FROM orders 
    INNER JOIN products ON products.id = orders.product_id
    WHERE products.name = 'Desk'
);
"""

module.check_query('E2', Q_E2)

游릭 That's correct!

  first_name last_name
0       John       Doe
1     Ashton      Cole
2     Raylee      Diaz
3    Cameron    Taylor

### Question E3
Upper management wants to gain insight in consumer behavior. Calculate the total spend per customer. <br>
Display the first and last name together with the total spend (as `total_spend`) in ascending order based on total spend.

In [27]:
Q_E3 = """
SELECT customers.first_name, customers.last_name, SUM(orders.quantity * products.price) AS total_spend
FROM customers
INNER JOIN orders ON orders.customer_id = customers.id
INNER JOIN products ON products.id = orders.product_id
GROUP BY customers.id
ORDER BY total_spend;
"""

module.check_query('E3', Q_E3)

游릭 That's correct!

  first_name last_name  total_spend
0      Axton    Rogers        19.80
1       Reed     Nixon        33.98
2    Vicente    Bryant       152.91
3      Jamie      Dean       239.70
4     Raylee      Diaz       325.79
5     Arthur    Holmes       328.80
6     Ashton      Cole       454.74
7       Shay      Hyde       835.86
8       John       Doe      1529.94
9    Cameron    Taylor      1996.50

### Question E4
For our customer loyalty program we want to retrieve a list of first and last names of customers that made at least 2 orders in the past with an average order value above 250 euros.

In [28]:
Q_E4 = """
SELECT customers.first_name, customers.last_name
FROM customers
WHERE customers.id IN (
    SELECT orders.customer_id
    FROM orders
    INNER JOIN products ON orders.product_id = products.id
    GROUP BY orders.customer_id
    HAVING AVG(orders.quantity * products.price) > 250
);
"""

module.check_query('E4', Q_E4)

游릭 That's correct!

  first_name last_name
0       John       Doe
1       Shay      Hyde
2    Cameron    Taylor

[Back to top](#module-3---structured-query-language-sql)
<hr>

## Congratulations!

You successfully completed all parts and created all queries that are requested! <br>
Through running other queries you are able to validate whether the queries you have written are correct.

Feel free to continue to our next module, **Module 4: Machine Learning (ML)**.